In [373]:
import pandas as pd

In [374]:
master = pd.read_pickle('../data/interim/master.pkl')
team_splits = pd.read_pickle('../data/interim/team_splits_multi_index.pkl')

In [375]:
master.head()

,firstName,lastName,pos,birthYear,birthMon,birthDay,birthCountry,birthState,birthCity
playerID,,,,,,,,,
aaltoan01,Antti,Aalto,C,1975.0,3.0,4.0,Finland,NaN,Lappeenranta
abdelju01,Justin,Abdelkader,L,1987.0,2.0,25.0,USA,MI,Muskegon
abidra01,Ramzi,Abid,L,1980.0,3.0,24.0,Canada,QC,Montreal
abrahth01,Thommy,Abrahamsson,D,1947.0,4.0,12.0,Sweden,NaN,Leksand
actonke01,Keith,Acton,C,1958.0,4.0,15.0,Canada,ON,Stouffville

In [376]:
master['birthDate'] = pd.to_datetime(arg={
    'year': master.birthYear,
    'month': master.birthMon,
    'day': master.birthDay,
})

In [377]:
master.drop(columns=['birthYear', 'birthMon', 'birthDay'], inplace=True)

In [378]:
master.head()

,firstName,lastName,pos,birthCountry,birthState,birthCity,birthDate
playerID,,,,,,,
aaltoan01,Antti,Aalto,C,Finland,NaN,Lappeenranta,1975-03-04
abdelju01,Justin,Abdelkader,L,USA,MI,Muskegon,1987-02-25
abidra01,Ramzi,Abid,L,Canada,QC,Montreal,1980-03-24
abrahth01,Thommy,Abrahamsson,D,Sweden,NaN,Leksand,1947-04-12
actonke01,Keith,Acton,C,Canada,ON,Stouffville,1958-04-15

In [379]:
ts = master.iloc[0, -1]
ts.day_name(), ts.month_name(), ts.year, ts.day

('Tuesday', 'March', 1975, 4)

In [380]:
tsz = ts.tz_localize('America/Toronto')
tsz

Timestamp('1975-03-04 00:00:00-0500', tz='America/Toronto')

In [381]:
tsz.tz_convert('Europe/London')

Timestamp('1975-03-04 05:00:00+0000', tz='Europe/London')

In [382]:
master['birthDate'].dt.strftime('%d-%m-%Y')

playerID
aaltoan01    04-03-1975
abdelju01    25-02-1987
abidra01     24-03-1980
abrahth01    12-04-1947
actonke01    15-04-1958
                ...
zubruda01    16-06-1978
zuccama01    01-09-1987
zuckeja01    16-01-1992
zukemi01     16-04-1954
zyuzian01    21-01-1978
Name: birthDate, Length: 4627, dtype: object

In [383]:
strings = master['birthDate'].dt.strftime('%Y-%m-%d')
strings.head(3)

playerID
aaltoan01    1975-03-04
abdelju01    1987-02-25
abidra01     1980-03-24
Name: birthDate, dtype: object

In [384]:
dates = pd.to_datetime(strings)

In [385]:
dates.head(3)

playerID
aaltoan01   1975-03-04
abdelju01   1987-02-25
abidra01    1980-03-24
Name: birthDate, dtype: datetime64[ns]

In [386]:
strings = strings.str.replace('-', 'xx')

# strings = strings.loc['birthDate'].str.replace('-', 'xx')

In [387]:
# pd.to_datetime(strings)

In [388]:
strings_errors = strings.copy()

In [389]:
strings_errors.iloc[34] = "xx123"

In [390]:
strings_errors

playerID
aaltoan01    1975xx03xx04
abdelju01    1987xx02xx25
abidra01     1980xx03xx24
abrahth01    1947xx04xx12
actonke01    1958xx04xx15
                 ...
zubruda01    1978xx06xx16
zuccama01    1987xx09xx01
zuckeja01    1992xx01xx16
zukemi01     1954xx04xx16
zyuzian01    1978xx01xx21
Name: birthDate, Length: 4627, dtype: object

In [391]:
parsed = pd.to_datetime(strings_errors, format='%Yxx%mxx%d', errors='coerce')
parsed

playerID
aaltoan01   1975-03-04
abdelju01   1987-02-25
abidra01    1980-03-24
abrahth01   1947-04-12
actonke01   1958-04-15
               ...
zubruda01   1978-06-16
zuccama01   1987-09-01
zuckeja01   1992-01-16
zukemi01    1954-04-16
zyuzian01   1978-01-21
Name: birthDate, Length: 4627, dtype: datetime64[ns]

In [392]:
parsed1 = pd.to_datetime(strings_errors, format='%Yxx%mxx%d', errors='ignore')
parsed1.iloc[32: 40]

/tmp/ipykernel_12893/2790913966.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  parsed1 = pd.to_datetime(strings_errors, format='%Yxx%mxx%d', errors='ignore')

playerID
alleyst01    1953xx12xx29
allisda01    1959xx04xx14
allisja01           xx123
allisja02    1975xx05xx13
allismi01    1961xx03xx28
allisra01    1959xx03xx04
almonco01    1989xx07xx24
alzneka01    1988xx09xx24
Name: birthDate, dtype: object

In [393]:
strings_errors

playerID
aaltoan01    1975xx03xx04
abdelju01    1987xx02xx25
abidra01     1980xx03xx24
abrahth01    1947xx04xx12
actonke01    1958xx04xx15
                 ...
zubruda01    1978xx06xx16
zuccama01    1987xx09xx01
zuckeja01    1992xx01xx16
zukemi01     1954xx04xx16
zyuzian01    1978xx01xx21
Name: birthDate, Length: 4627, dtype: object

In [394]:
birth_dates = pd.Series(master.index, index=master.birthDate)
birth_dates.head()

birthDate
1975-03-04    aaltoan01
1987-02-25    abdelju01
1980-03-24     abidra01
1947-04-12    abrahth01
1958-04-15    actonke01
Name: playerID, dtype: object

In [395]:
birth_dates.sort_index(inplace=True)
birth_dates

birthDate
1940-01-27    harpete01
1940-03-22     keonda01
1940-10-03    ratelje01
1942-02-20    esposph01
1943-04-23    esposto01
                ...
1992-11-23    landega01
1992-12-07    coutuse01
1993-03-15    scheima01
1993-04-12    nugenry01
1993-04-18    zibanmi01
Name: playerID, Length: 4627, dtype: object

In [396]:
birth_dates.loc['1980']

birthDate
1980-01-02    zalesmi01
1980-01-10    stanara01
1980-01-13    bouckty01
1980-01-13     ruppmi01
1980-01-15    papinju01
                ...
1980-11-24    fritzmi01
1980-11-25    lilesjo01
1980-12-02     wardjo02
1980-12-09    baydary01
1980-12-30    lysakbr01
Name: playerID, Length: 145, dtype: object

In [397]:
birth_dates.loc['1980-07']

birthDate
1980-07-03    miettan01
1980-07-05    huntetr01
1980-07-08    chouier01
1980-07-15    cheecjo01
1980-07-17    millery01
1980-07-19    tanabda01
1980-07-20    arsende01
1980-07-22    kalindm01
1980-07-24    jillsje01
1980-07-24    printda01
1980-07-31    fischji01
Name: playerID, dtype: object

In [398]:
birth_dates.loc['1980-07-24'] # data jest rodzajem multindeksu, jest tak obsłużone, żeby można było wyszukać po części daty

birthDate
1980-07-24    jillsje01
1980-07-24    printda01
Name: playerID, dtype: object

In [399]:
birth_dates.loc['1980-07-20':'1980-07-31']

birthDate
1980-07-20    arsende01
1980-07-22    kalindm01
1980-07-24    jillsje01
1980-07-24    printda01
1980-07-31    fischji01
Name: playerID, dtype: object

In [400]:
birth_dates.head()

birthDate
1940-01-27    harpete01
1940-03-22     keonda01
1940-10-03    ratelje01
1942-02-20    esposph01
1943-04-23    esposto01
Name: playerID, dtype: object

In [401]:
birth_dates.resample('1QS')

In [402]:
birth_dates.resample('1W').count()

birthDate
1940-01-28    1
1940-02-04    0
1940-02-11    0
1940-02-18    0
1940-02-25    0
             ..
1993-03-21    1
1993-03-28    0
1993-04-04    0
1993-04-11    0
1993-04-18    2
Freq: W-SUN, Name: playerID, Length: 2778, dtype: int64

In [403]:
birth_dates

birthDate
1940-01-27    harpete01
1940-03-22     keonda01
1940-10-03    ratelje01
1942-02-20    esposph01
1943-04-23    esposto01
                ...
1992-11-23    landega01
1992-12-07    coutuse01
1993-03-15    scheima01
1993-04-12    nugenry01
1993-04-18    zibanmi01
Name: playerID, Length: 4627, dtype: object

In [404]:
birth_dates.shift(1, freq='D') # przesunięcie o jeden dzień wszystkich dat

birthDate
1940-01-28    harpete01
1940-03-23     keonda01
1940-10-04    ratelje01
1942-02-21    esposph01
1943-04-24    esposto01
                ...
1992-11-24    landega01
1992-12-08    coutuse01
1993-03-16    scheima01
1993-04-13    nugenry01
1993-04-19    zibanmi01
Name: playerID, Length: 4627, dtype: object

In [405]:
team_splits.head()

                            W    L    T  OL
name          year month
Boston Bruins 1981 Sep    NaN  NaN  NaN NaN
                   Oct    6.0  2.0  3.0 NaN
                   Nov    7.0  5.0  1.0 NaN
                   Dec    9.0  3.0  0.0 NaN
                   Jan    7.0  6.0  3.0 NaN

In [406]:
pd.Period("1980-Sep")

Period('1980-09', 'M')

In [407]:
team_splits.index.levels[1]

Index([1981, 1982, 1983, 1984, 1985, 1986, 1987, 1988, 1989, 1990, 1991, 1992,
       1993, 1994, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2005,
       2006, 2007, 2008, 2009, 2010, 2011],
      dtype='int64', name='year')

In [408]:
team_splits.head(2).apply(lambda x: print(x), axis=1)

W    NaN
L    NaN
T    NaN
OL   NaN
Name: (Boston Bruins, 1981, Sep), dtype: float64
W     6.0
L     2.0
T     3.0
OL    NaN
Name: (Boston Bruins, 1981, Oct), dtype: float64

name           year  month
Boston Bruins  1981  Sep      None
                     Oct      None
dtype: object

In [409]:
team_splits = team_splits.reset_index()

In [410]:
team_splits.head()

            name  year month    W    L    T  OL
0  Boston Bruins  1981   Sep  NaN  NaN  NaN NaN
1  Boston Bruins  1981   Oct  6.0  2.0  3.0 NaN
2  Boston Bruins  1981   Nov  7.0  5.0  1.0 NaN
3  Boston Bruins  1981   Dec  9.0  3.0  0.0 NaN
4  Boston Bruins  1981   Jan  7.0  6.0  3.0 NaN

In [411]:
dates = team_splits.apply(lambda row: pd.Period(f"{row.year}-{row.month}"), axis=1)
dates

0       1981-09
1       1981-10
2       1981-11
3       1981-12
4       1981-01
         ...
6163    2011-12
6164    2011-01
6165    2011-02
6166    2011-03
6167    2011-04
Length: 6168, dtype: period[M]

In [412]:
team_splits.month = dates

In [413]:
team_splits

               name  year    month     W    L    T   OL
0     Boston Bruins  1981  1981-09   NaN  NaN  NaN  NaN
1     Boston Bruins  1981  1981-10   6.0  2.0  3.0  NaN
2     Boston Bruins  1981  1981-11   7.0  5.0  1.0  NaN
3     Boston Bruins  1981  1981-12   9.0  3.0  0.0  NaN
4     Boston Bruins  1981  1981-01   7.0  6.0  3.0  NaN
...             ...   ...      ...   ...  ...  ...  ...
6163  Winnipeg Jets  2011  2011-12  10.0  3.0  NaN  1.0
6164  Winnipeg Jets  2011  2011-01   4.0  8.0  NaN  1.0
6165  Winnipeg Jets  2011  2011-02   7.0  5.0  NaN  2.0
6166  Winnipeg Jets  2011  2011-03   6.0  7.0  NaN  1.0
6167  Winnipeg Jets  2011  2011-04   1.0  1.0  NaN  1.0

[6168 rows x 7 columns]

In [414]:
team_splits.drop('year', axis=1, inplace=True)

In [415]:
team_splits

               name    month     W    L    T   OL
0     Boston Bruins  1981-09   NaN  NaN  NaN  NaN
1     Boston Bruins  1981-10   6.0  2.0  3.0  NaN
2     Boston Bruins  1981-11   7.0  5.0  1.0  NaN
3     Boston Bruins  1981-12   9.0  3.0  0.0  NaN
4     Boston Bruins  1981-01   7.0  6.0  3.0  NaN
...             ...      ...   ...  ...  ...  ...
6163  Winnipeg Jets  2011-12  10.0  3.0  NaN  1.0
6164  Winnipeg Jets  2011-01   4.0  8.0  NaN  1.0
6165  Winnipeg Jets  2011-02   7.0  5.0  NaN  2.0
6166  Winnipeg Jets  2011-03   6.0  7.0  NaN  1.0
6167  Winnipeg Jets  2011-04   1.0  1.0  NaN  1.0

[6168 rows x 6 columns]

In [416]:
team_splits.set_index("month", inplace=True)

In [417]:
team_splits

                  name     W    L    T   OL
month
1981-09  Boston Bruins   NaN  NaN  NaN  NaN
1981-10  Boston Bruins   6.0  2.0  3.0  NaN
1981-11  Boston Bruins   7.0  5.0  1.0  NaN
1981-12  Boston Bruins   9.0  3.0  0.0  NaN
1981-01  Boston Bruins   7.0  6.0  3.0  NaN
...                ...   ...  ...  ...  ...
2011-12  Winnipeg Jets  10.0  3.0  NaN  1.0
2011-01  Winnipeg Jets   4.0  8.0  NaN  1.0
2011-02  Winnipeg Jets   7.0  5.0  NaN  2.0
2011-03  Winnipeg Jets   6.0  7.0  NaN  1.0
2011-04  Winnipeg Jets   1.0  1.0  NaN  1.0

[6168 rows x 5 columns]

In [418]:
team_splits.groupby("name").resample("QE").sum()

/tmp/ipykernel_12893/1670370862.py:1: FutureWarning: Resampling with a PeriodIndex is deprecated. Cast index to DatetimeIndex before resampling instead.
  team_splits.groupby("name").resample("QE").sum()
/tmp/ipykernel_12893/1670370862.py:1: FutureWarning: Resampling a groupby with a PeriodIndex is deprecated. Cast to DatetimeIndex before resampling instead.
  team_splits.groupby("name").resample("QE").sum()

                                                         name     W     L  \
name          month
Anaheim Ducks 2006Q1  Anaheim DucksAnaheim DucksAnaheim Ducks  19.0  13.0
              2006Q2                            Anaheim Ducks   1.0   0.0
              2006Q3                            Anaheim Ducks   0.0   0.0
              2006Q4  Anaheim DucksAnaheim DucksAnaheim Ducks  28.0   7.0
              2007Q1  Anaheim DucksAnaheim DucksAnaheim Ducks  26.0  10.0
...                                                       ...   ...   ...
Winnipeg Jets 2010Q4                                        0   0.0   0.0
              2011Q1  Winnipeg JetsWinnipeg JetsWinnipeg Jets  17.0  20.0
              2011Q2                            Winnipeg Jets   1.0   1.0
              2011Q3                            Winnipeg Jets   0.0   0.0
              2011Q4  Winnipeg JetsWinnipeg JetsWinnipeg Jets  19.0  14.0

                        T   OL
name          month
Anaheim Ducks 2006Q1  0.0  6.0
              2006Q2  0.0  2.0
              2006Q3  0.0  0.0
              2006Q4  0.0  6.0
              2007Q1  0.0  3.0
...                   ...  ...
Winnipeg Jets 2010Q4  0.0  0.0
              2011Q1  0.0  4.0
              2011Q2  0.0  1.0
              2011Q3  0.0  0.0
              2011Q4  0.0  5.0

[3264 rows x 5 columns]

In [419]:
team_splits.index = team_splits.index.to_timestamp()

In [420]:
team_splits

                     name     W    L    T   OL
month
1981-09-01  Boston Bruins   NaN  NaN  NaN  NaN
1981-10-01  Boston Bruins   6.0  2.0  3.0  NaN
1981-11-01  Boston Bruins   7.0  5.0  1.0  NaN
1981-12-01  Boston Bruins   9.0  3.0  0.0  NaN
1981-01-01  Boston Bruins   7.0  6.0  3.0  NaN
...                   ...   ...  ...  ...  ...
2011-12-01  Winnipeg Jets  10.0  3.0  NaN  1.0
2011-01-01  Winnipeg Jets   4.0  8.0  NaN  1.0
2011-02-01  Winnipeg Jets   7.0  5.0  NaN  2.0
2011-03-01  Winnipeg Jets   6.0  7.0  NaN  1.0
2011-04-01  Winnipeg Jets   1.0  1.0  NaN  1.0

[6168 rows x 5 columns]

In [423]:
team_splits.groupby("name")[["W", "L", "T", "OL"]].resample("QE").sum()

                             W     L    T   OL
name          month
Anaheim Ducks 2006-03-31  19.0  13.0  0.0  6.0
              2006-06-30   1.0   0.0  0.0  2.0
              2006-09-30   0.0   0.0  0.0  0.0
              2006-12-31  28.0   7.0  0.0  6.0
              2007-03-31  26.0  10.0  0.0  3.0
...                        ...   ...  ...  ...
Winnipeg Jets 2010-12-31   0.0   0.0  0.0  0.0
              2011-03-31  17.0  20.0  0.0  4.0
              2011-06-30   1.0   1.0  0.0  1.0
              2011-09-30   0.0   0.0  0.0  0.0
              2011-12-31  19.0  14.0  0.0  5.0

[3264 rows x 4 columns]

In [424]:
team_splits.groupby("name")[["W", "L", "T", "OL"]].resample("QE").mean()

                                 W         L   T        OL
name          month
Anaheim Ducks 2006-03-31  6.333333  4.333333 NaN  2.000000
              2006-06-30  1.000000  0.000000 NaN  2.000000
              2006-09-30       NaN       NaN NaN       NaN
              2006-12-31  9.333333  2.333333 NaN  2.000000
              2007-03-31  8.666667  3.333333 NaN  1.000000
...                            ...       ...  ..       ...
Winnipeg Jets 2010-12-31       NaN       NaN NaN       NaN
              2011-03-31  5.666667  6.666667 NaN  1.333333
              2011-06-30  1.000000  1.000000 NaN  1.000000
              2011-09-30       NaN       NaN NaN       NaN
              2011-12-31  6.333333  4.666667 NaN  1.666667

[3264 rows x 4 columns]

In [425]:
team_splits.to_pickle('../data/interim/team_splits_date_index.pkl')

In [426]:
birth_dates.to_pickle('../data/interim/birth_dates.pkl')